{
  "title": "Anker Prime Charger, 200W 6-Port GaN Charging Station, USB-C PD Fast Charging Desktop Charger, Compatible with iPhone, Samsung, MacBook, Dell and More",
  "description": "Ultra-Powerful Charging Station: Experience the convenience of powering six devices at once with Anker Prime charging station's ultra-powerful 200W output.",
  "affiliate_link": "https://www.amazon.com/dp/B0CT2NQ7WG?tag=imabot01-20",
  "top_reviews": "[{\"id\":\"R1RFQ5P845GZY\",\"title\":\"One of the best values in the USB-C hardware market\",\"body\":\"This thing is a real powerhouse! I use it as my go-to charger for everything (an iPad Pro, iPad, MacBook Air M3, and iPhone as well as smaller accessories from time to time), and I mention all that to note that all of it combined will not use 200W so I can't speak to its ability to sustain full output for any length of time. But I think most people have similar needs/devices to the ones I mentioned, and I can say it never fails to charge all of them extrmekey rapidly, and all at once too. It gets warm, but it's never been uncomfortable to touch. It's a lot smaller than expected, which is actually kind of nice  Update: ended up using this one more on the go, and while it doesn’t get advertised as being portable, but it’s really pretty easy to carry around. It’s a lot smaller than you’re probably expecting (see pics). Honestly not much bigger than a lot of the OEM MacBook chargers that come with the computer. Also very easy to plug in anywhere since you have the cord (easily foldable, at the bottom of the bag in the pics) that can plug into any outlet even with very little space, all while the charger sits right on your table. I’ve used it in Starbucks and stuff and it doesn’t even jump out like I have some ridiculous amount of equipment or over-the-top setup. It doesn’t stand out or take up more of my space than any normal charger would, and now I can easily charge anything from wherever. Seriously, great product!! Read more\",\"asin\":\"B0CT2NQ7WG\",\"body_html\":\"<script>   (function() {    P.when(&apos;cr-A&apos;, &apos;ready&apos;).execute(function(A) {     if(typeof A.toggleExpanderAriaLabel === &apos;function&apos;) {      A.toggleExpanderAriaLabel(&apos;review_text_read_more&apos;, &apos;Read more of this review&apos;, &apos;Read less of this review&apos;);     }    });   })();  </script>  <style>   .review-text-read-more-expander:focus-visible {    outline: 2px solid #2162a1;    outline-offset: 2px;    border-radius: 5px;   }  </style> <div data-a-expander-name=\\\"review_text_read_more\\\" data-a-expander-collapsed-height=\\\"300\\\" class=\\\"a-expander-collapsed-height a-row a-expander-container a-expander-partial-collapse-container review-text-read-more-expander\\\" style=\\\"max-height:300px\\\"><div data-hook=\\\"review-collapsed\\\" data-expanded=\\\"false\\\" class=\\\"a-expander-content reviewText review-text-content a-expander-partial-collapse-content\\\">             <span>This thing is a real powerhouse! I use it as my go-to charger for everything (an iPad Pro, iPad, MacBook Air M3, and iPhone as well as smaller accessories from time to time), and I mention all that to note that all of it combined will not use 200W so I can&apos;t speak to its ability to sustain full output for any length of time. But I think most people have similar needs/devices to the ones I mentioned, and I can say it never fails to charge all of them extrmekey rapidly, and all at once too. It gets warm, but it&apos;s never been uncomfortable to touch. It&apos;s a lot smaller than expected, which is actually kind of nice<br/><br/>Update: ended up using this one more on the go, and while it doesn&#x2019;t get advertised as being portable, but it&#x2019;s really pretty easy to carry around. It&#x2019;s a lot smaller than you&#x2019;re probably expecting (see pics). Honestly not much bigger than a lot of the OEM MacBook chargers that come with the computer. Also very easy to plug in anywhere since you have the cord (easily foldable, at the bottom of the bag in the pics) that can plug into any outlet even with very little space, all while the charger sits right on your table. I&#x2019;ve used it in Starbucks and stuff and it doesn&#x2019;t even jump out like I have some ridiculous amount of equipment or over-the-top setup. It doesn&#x2019;t stand out or take up more of my space than any normal charger would, and now I can easily charge anything from wherever. Seriously, great product!!<br/></span>   </div><div class=\\\"a-expander-header a-expander-partial-collapse-header\\\"><div class=\\\"a-expander-content-fade\\\"/><a href=\\\"javascript:void(0)\\\" data-hook=\\\"expand-collapse-read-more-less\\\" aria-label=\\\"Read more of this review\\\" aria-expanded=\\\"false\\\" role=\\\"button\\\" data-action=\\\"a-expander-toggle\\\" class=\\\"a-declarative\\\" data-a-expander-toggle=\\\"{&quot;allowLinkDefault&quot;:true, &quot;expand_prompt&quot;:&quot;Read more&quot;, &quot;collapse_prompt&quot;:&quot;Read less&quot;}\\\"><i class=\\\"a-icon a-icon-extender-expand\\\"/><span class=\\\"a-expander-prompt\\\">Read more</span></a></div></div>\",\"link\":\"https://www.amazon.com/gp/customer-reviews/R1RFQ5P845GZY/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&ASIN=B0CT2NQ7WG\",\"rating\":5,\"date\":{\"raw\":\"Reviewed in the United States on May 21, 2025\",\"utc\":\"2025-05-21T00:00:00.000Z\"},\"profile\":{\"name\":\"Tony\",\"link\":\"https://www.amazon.com/gp/profile/amzn1.account.AHSIVAAN2NAZBZCXGYWEQEMD5EQA/ref=cm_cr_dp_d_gw_tr?ie=UTF8\",\"id\":\"AHSIVAAN2NAZBZCXGYWEQEMD5EQA\"},\"vine_program\":false,\"verified_purchase\":true,\"images\":[{\"link\":\"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif\"},{\"link\":\"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif\"},{\"link\":\"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif\"}],\"helpful_votes\":3,\"review_country\":\"us\",\"is_global_review\":false},{\"id\":\"R2WTOC2YQLYR4N\",\"title\":\"All good\",\"body\":\"A brief review. Most people buying this will know what they're after. I've been in IT a while and do get a little paranoid about devices like this even from better known brands due to sensitive data potentially being lost if anything were to go wrong.  I've had it a bit now. Various phones first, all fine. Charges nice and quick. Bumped it up to using on Raspberry Pis. All good. Finally stepped it up to charging my Macs and use it to charge my higher end power banks.  It's smooth. No apparent heat. Nothing really to say, in a good way. Just plug it in and plug in what you need, being mindful of it's 200w limit and other obvious things.  Anker's worked well for me so far. This item appears as though it'll last. It's nice to have a compact power supply that well, actually supplies power instead of stating it does, to find out it's a lot more limited than it appeared.  Good buy. Read more\",\"asin\":\"B0CT2NQ7WG\",\"body_html\":\"<div data-a-expander-name=\\\"review_text_read_more\\\" data-a-expander-collapsed-height=\\\"300\\\" class=\\\"a-expander-collapsed-height a-row a-expander-container a-expander-partial-collapse-container review-text-read-more-expander\\\" style=\\\"max-height:300px\\\"><div data-hook=\\\"review-collapsed\\\" data-expanded=\\\"false\\\" class=\\\"a-expander-content reviewText review-text-content a-expander-partial-collapse-content\\\">             <span>A brief review. Most people buying this will know what they&apos;re after. I&apos;ve been in IT a while and do get a little paranoid about devices like this even from better known brands due to sensitive data potentially being lost if anything were to go wrong.<br/><br/>I&apos;ve had it a bit now. Various phones first, all fine. Charges nice and quick. Bumped it up to using on Raspberry Pis. All good. Finally stepped it up to charging my Macs and use it to charge my higher end power banks.<br/><br/>It&apos;s smooth. No apparent heat. Nothing really to say, in a good way. Just plug it in and plug in what you need, being mindful of it&apos;s 200w limit and other obvious things.<br/><br/>Anker&apos;s worked well for me so far. This item appears as though it&apos;ll last. It&apos;s nice to have a compact power supply that well, actually supplies power instead of stating it does, to find out it&apos;s a lot more limited than it appeared.<br/><br/>Good buy.<br/></span>   </div><div class=\\\"a-expander-header a-expander-partial-collapse-header\\\"><div class=\\\"a-expander-content-fade\\\"/><a href=\\\"javascript:void(0)\\\" data-hook=\\\"expand-collapse-read-more-less\\\" aria-label=\\\"Read more of this review\\\" aria-expanded=\\\"false\\\" role=\\\"button\\\" data-action=\\\"a-expander-toggle\\\" class=\\\"a-declarative\\\" data-a-expander-toggle=\\\"{&quot;allowLinkDefault&quot;:true, &quot;expand_prompt&quot;:&quot;Read more&quot;, &quot;collapse_prompt&quot;:&quot;Read less&quot;}\\\"><i class=\\\"a-icon a-icon-extender-expand\\\"/><span class=\\\"a-expander-prompt\\\">Read more</span></a></div></div>\",\"link\":\"https://www.amazon.com/gp/customer-reviews/R2WTOC2YQLYR4N/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&ASIN=B0CT2NQ7WG\",\"rating\":5,\"date\":{\"raw\":\"Reviewed in the United States on June 8, 2025\",\"utc\":\"2025-06-08T00:00:00.000Z\"},\"profile\":{\"name\":\"IS\",\"link\":\"https://www.amazon.com/gp/profile/amzn1.account.AEXUVNR626ZSL2ONJVNUZCALQLAQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8\",\"id\":\"AEXUVNR626ZSL2ONJVNUZCALQLAQ\"},\"vine_program\":false,\"verified_purchase\":true,\"helpful_votes\":3,\"review_country\":\"us\",\"is_global_review\":false},{\"id\":\"R2EZDFQZU2W0CI\",\"title\":\"Good charger - Buy this instead of the cheaper ones - You get what you pay for!\",\"body\":\"There is no difference between the USB C ports which is a good thing. It also seems to perform as advertised and give you the actual listed watts rather than the cheap knock don't. This is also heavier and clearly better made than I one I bought for $35. The saying of you get what you pay for. I paid more and got a respected brand, I got something good. I paid cheap and got junk and wasted my money for it. Buy this instead. Read more\",\"asin\":\"B0CT2NQ7WG\",\"body_html\":\"<div data-a-expander-name=\\\"review_text_read_more\\\" data-a-expander-collapsed-height=\\\"300\\\" class=\\\"a-expander-collapsed-height a-row a-expander-container a-expander-partial-collapse-container review-text-read-more-expander\\\" style=\\\"max-height:300px\\\"><div data-hook=\\\"review-collapsed\\\" data-expanded=\\\"false\\\" class=\\\"a-expander-content reviewText review-text-content a-expander-partial-collapse-content\\\">             <span>There is no difference between the USB C ports which is a good thing. It also seems to perform as advertised and give you the actual listed watts rather than the cheap knock don&apos;t. This is also heavier and clearly better made than I one I bought for $35. The saying of you get what you pay for. I paid more and got a respected brand, I got something good. I paid cheap and got junk and wasted my money for it. Buy this instead.<br/></span>   </div><div class=\\\"a-expander-header a-expander-partial-collapse-header\\\"><div class=\\\"a-expander-content-fade\\\"/><a href=\\\"javascript:void(0)\\\" data-hook=\\\"expand-collapse-read-more-less\\\" aria-label=\\\"Read more of this review\\\" aria-expanded=\\\"false\\\" role=\\\"button\\\" data-action=\\\"a-expander-toggle\\\" class=\\\"a-declarative\\\" data-a-expander-toggle=\\\"{&quot;allowLinkDefault&quot;:true, &quot;expand_prompt&quot;:&quot;Read more&quot;, &quot;collapse_prompt&quot;:&quot;Read less&quot;}\\\"><i class=\\\"a-icon a-icon-extender-expand\\\"/><span class=\\\"a-expander-prompt\\\">Read more</span></a></div></div>\",\"link\":\"https://www.amazon.com/gp/customer-reviews/R2EZDFQZU2W0CI/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&ASIN=B0CT2NQ7WG\",\"rating\":5,\"date\":{\"raw\":\"Reviewed in the United States on June 14, 2025\",\"utc\":\"2025-06-14T00:00:00.000Z\"},\"profile\":{\"name\":\"Paul J\",\"link\":\"https://www.amazon.com/gp/profile/amzn1.account.AG3RMKAMYE7O7SJWFX7O7MDNGW5A/ref=cm_cr_dp_d_gw_tr?ie=UTF8\",\"id\":\"AG3RMKAMYE7O7SJWFX7O7MDNGW5A\"},\"vine_program\":false,\"verified_purchase\":true,\"review_country\":\"us\",\"is_global_review\":false},{\"id\":\"R2GTVVJQ0R5IFQ\",\"title\":\"Great selection of ports and price. My new favorite charging station.  May buy 2 more!\",\"body\":\"I've bought at least a half dozen USB multi-port chargers or USB charging stations for laptops and other devices over the years. This included at least 3 USB-C PD charging systems for laptops, for the last couple of years I've been carrying around an old Cable Matters with 3 USB-A, 1 USB-C PD as my travel charger when taking long trips. It worked but the port selection and power capability was limited and the Anker Prime 200W is my new favorite.  I bought one on Prime Day and might get another for the work office and maybe another for the home office. Why?  The specifications say a lot, 2 USB-A ports for legacy devices and 4 USB-C ports for modern devices. 200 Watt capability and multiple USB-C PD fast charging ports means that the family doesn't need to argue over who is getting the one high speed connection.  More specifically, why the Anker 200W charger:  1. First of all, it is offered at a great price compared to other \\\"brand name\\\" chargers with similar capability like UGreen which is about double the price. There are a lot of \\\"no-name\\\" power stations for even less but I would feel a little nervous about leaving those plugged in 24x7. 2. It does not have flat plug. This isn't a pro for everyone and may be a non-issue or con for some for some. In my use case, we have an outlet underneath our couch that needs to be a straight, traditional plug and this is one of the few competing chargers that still has a straight plug. 3. The split of 2 and 4 (USB-A vs. C) seems good for our mix of new and legacy devices for the next several years. Of course the more ports the better but this is good. 4. In standby or with lower power draw it doesn't get warm. Like the new Gallium Nitride chargers!  I'm thinking of also getting one for a 10 seat conference room at my office. It would be nice for many people to be able to plug in their devices simultaneously. Specifically, 2 or 3 non-gaming laptops during long work meetings.  One interesting item is that it doesn't have a light to include that it is on. Somewhat surprising and an unobtrusive light might be nice but it would also mean that it is easier to use in a bedroom or hotel room setting.  Traveling with this will also be a nice use case, especially for family travel. Likely to just throw in a suitcase though given the weight rather than carry around in my laptop bag.  Some other reviews complain that it is unable to provide more than 50W of power to each USB-C port while trying to charge higher power devices. (I really like the use of a device for displaying power from Brian T.!) I haven't tested that yet but my laptops are all lower power draws (14\\\" non-gaming laptops) so I don't think that this will be much of an issue in my use cases at home or the office. Might almost be a feature to not have to worry about one gaming laptop sucking up most of the power and leaving the others unable to charge at enough power.  Who is it for: 1. People with a mix of new and legacy USB-C devices. 2. People that need a straight power plug. 3. Budget conscious  Who is it NOT for: 1. People with demanding gaming/high performance laptops. 2. People looking for a lightweight charger to carry around daily in their shoulder bag. 3. People that need a flat plug to go behind furniture.  The Anker 200W met all my expectations when I purchased it. It seems very durable and expect it to be reliable for many years. Read more\",\"asin\":\"B0CT2NQ7WG\",\"body_html\":\"<div data-a-expander-name=\\\"review_text_read_more\\\" data-a-expander-collapsed-height=\\\"300\\\" class=\\\"a-expander-collapsed-height a-row a-expander-container a-expander-partial-collapse-container review-text-read-more-expander\\\" style=\\\"max-height:300px\\\"><div data-hook=\\\"review-collapsed\\\" data-expanded=\\\"false\\\" class=\\\"a-expander-content reviewText review-text-content a-expander-partial-collapse-content\\\">             <span>I&apos;ve bought at least a half dozen USB multi-port chargers or USB charging stations for laptops and other devices over the years. This included at least 3 USB-C PD charging systems for laptops, for the last couple of years I&apos;ve been carrying around an old Cable Matters with 3 USB-A, 1 USB-C PD as my travel charger when taking long trips. It worked but the port selection and power capability was limited and the Anker Prime 200W is my new favorite.<br/><br/>I bought one on Prime Day and might get another for the work office and maybe another for the home office. Why?<br/><br/>The specifications say a lot, 2 USB-A ports for legacy devices and 4 USB-C ports for modern devices. 200 Watt capability and multiple USB-C PD fast charging ports means that the family doesn&apos;t need to argue over who is getting the one high speed connection.<br/><br/>More specifically, why the Anker 200W charger:<br/><br/>1. First of all, it is offered at a great price compared to other &quot;brand name&quot; chargers with similar capability like UGreen which is about double the price. There are a lot of &quot;no-name&quot; power stations for even less but I would feel a little nervous about leaving those plugged in 24x7.<br/>2. It does not have flat plug. This isn&apos;t a pro for everyone and may be a non-issue or con for some for some. In my use case, we have an outlet underneath our couch that needs to be a straight, traditional plug and this is one of the few competing chargers that still has a straight plug.<br/>3. The split of 2 and 4 (USB-A vs. C) seems good for our mix of new and legacy devices for the next several years. Of course the more ports the better but this is good.<br/>4. In standby or with lower power draw it doesn&apos;t get warm. Like the new Gallium Nitride chargers!<br/><br/>I&apos;m thinking of also getting one for a 10 seat conference room at my office. It would be nice for many people to be able to plug in their devices simultaneously. Specifically, 2 or 3 non-gaming laptops during long work meetings.<br/><br/>One interesting item is that it doesn&apos;t have a light to include that it is on. Somewhat surprising and an unobtrusive light might be nice but it would also mean that it is easier to use in a bedroom or hotel room setting.<br/><br/>Traveling with this will also be a nice use case, especially for family travel. Likely to just throw in a suitcase though given the weight rather than carry around in my laptop bag.<br/><br/>Some other reviews complain that it is unable to provide more than 50W of power to each USB-C port while trying to charge higher power devices. (I really like the use of a device for displaying power from Brian T.!) I haven&apos;t tested that yet but my laptops are all lower power draws (14&quot; non-gaming laptops) so I don&apos;t think that this will be much of an issue in my use cases at home or the office. Might almost be a feature to not have to worry about one gaming laptop sucking up most of the power and leaving the others unable to charge at enough power.<br/><br/>Who is it for:<br/>1. People with a mix of new and legacy USB-C devices.<br/>2. People that need a straight power plug.<br/>3. Budget conscious<br/><br/>Who is it NOT for:<br/>1. People with demanding gaming/high performance laptops.<br/>2. People looking for a lightweight charger to carry around daily in their shoulder bag.<br/>3. People that need a flat plug to go behind furniture.<br/><br/>The Anker 200W met all my expectations when I purchased it. It seems very durable and expect it to be reliable for many years.<br/></span>   </div><div class=\\\"a-expander-header a-expander-partial-collapse-header\\\"><div class=\\\"a-expander-content-fade\\\"/><a href=\\\"javascript:void(0)\\\" data-hook=\\\"expand-collapse-read-more-less\\\" aria-label=\\\"Read more of this review\\\" aria-expanded=\\\"false\\\" role=\\\"button\\\" data-action=\\\"a-expander-toggle\\\" class=\\\"a-declarative\\\" data-a-expander-toggle=\\\"{&quot;allowLinkDefault&quot;:true, &quot;expand_prompt&quot;:&quot;Read more&quot;, &quot;collapse_prompt&quot;:&quot;Read less&quot;}\\\"><i class=\\\"a-icon a-icon-extender-expand\\\"/><span class=\\\"a-expander-prompt\\\">Read more</span></a></div></div>\",\"link\":\"https://www.amazon.com/gp/customer-reviews/R2GTVVJQ0R5IFQ/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&ASIN=B0CT2NQ7WG\",\"rating\":5,\"date\":{\"raw\":\"Reviewed in the United States on July 21, 2024\",\"utc\":\"2024-07-21T00:00:00.000Z\"},\"profile\":{\"name\":\"Timothy R. Anderson\",\"link\":\"https://www.amazon.com/gp/profile/amzn1.account.AFS25AN2I3Z4LPFPGCZ4SNNAUAOQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8\",\"id\":\"AFS25AN2I3Z4LPFPGCZ4SNNAUAOQ\",\"image\":\"https://m.media-amazon.com/images/S/amazon-avatars-global/9abd63cf-c274-401c-a169-3bb0e7383081._CR0%2C0%2C500%2C500_SX460_.jpg\"},\"vine_program\":false,\"verified_purchase\":true,\"images\":[{\"link\":\"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif\"}],\"helpful_votes\":27,\"review_country\":\"us\",\"is_global_review\":false},{\"id\":\"R1FCWAEC6NH9N3\",\"title\":\"Outstanding product\",\"body\":\"Great product, top quality, and super fast delivery. Couldn’t be happier! Read more\",\"body_html\":\"<script>   (function() {    P.when(&apos;cr-A&apos;, &apos;ready&apos;).execute(function(A) {     if(typeof A.toggleExpanderAriaLabel === &apos;function&apos;) {      A.toggleExpanderAriaLabel(&apos;review_text_read_more&apos;, &apos;Read more of this review&apos;, &apos;Read less of this review&apos;);     }    });   })();  </script>  <style>   .review-text-read-more-expander:focus-visible {    outline: 2px solid #2162a1;    outline-offset: 2px;    border-radius: 5px;   }  </style> <div data-a-expander-name=\\\"review_text_read_more\\\" data-a-expander-collapsed-height=\\\"300\\\" class=\\\"a-expander-collapsed-height a-row a-expander-container a-expander-partial-collapse-container review-text-read-more-expander\\\" style=\\\"max-height:300px\\\"><div data-hook=\\\"review-collapsed\\\" data-expanded=\\\"false\\\" class=\\\"a-expander-content reviewText review-text-content a-expander-partial-collapse-content\\\">             <span>Great product, top quality, and super fast delivery. Couldn&#x2019;t be happier!<br/></span>   </div><div class=\\\"a-expander-header a-expander-partial-collapse-header\\\"><div class=\\\"a-expander-content-fade\\\"/><a href=\\\"javascript:void(0)\\\" data-hook=\\\"expand-collapse-read-more-less\\\" aria-label=\\\"Read more of this review\\\" aria-expanded=\\\"false\\\" role=\\\"button\\\" data-action=\\\"a-expander-toggle\\\" class=\\\"a-declarative\\\" data-a-expander-toggle=\\\"{&quot;allowLinkDefault&quot;:true, &quot;expand_prompt&quot;:&quot;Read more&quot;, &quot;collapse_prompt&quot;:&quot;Read less&quot;}\\\"><i class=\\\"a-icon a-icon-extender-expand\\\"/><span class=\\\"a-expander-prompt\\\">Read more</span></a></div></div>\",\"rating\":5,\"date\":{\"raw\":\"Reviewed in Saudi Arabia on April 26, 2025\",\"utc\":\"2025-04-26T00:00:00.000Z\"},\"profile\":{\"name\":\"Shrouq\"},\"vine_program\":false,\"verified_purchase\":true,\"review_country\":\"us\",\"is_global_review\":true},{\"id\":\"R1GATDVF89205Y\",\"title\":\"Anker Prime USB C Charger (200W) – Worth Every Cent!\",\"body\":\"When my old desktop charger stopped working, I spent a fair bit of time looking for a replacement. I came across the Anker Prime USB C Charger, 200W 6-Port GaN Charging Station, and while the price initially made me hesitate, I quickly realised it was worth every cent.  Despite packing 200W of power, it’s incredibly compact, taking up very little space on my desk. Not only does it perform brilliantly, but it also has a premium look and feel, which I really appreciate.  With six ports, there’s more than enough capacity to charge multiple devices at once, and I love that it doesn’t heat up, so I never have to worry about overheating issues. Plus, it supports Super Fast Charging 2.0 for my Samsung Galaxy S24 Ultra, which is a huge bonus.  On top of its excellent build quality and performance, the 2-year warranty is a nice extra touch. If someone is looking for a high-quality desktop charger that ticks all the boxes, I wouldn’t hesitate to recommend this one. Read more\",\"body_html\":\"<div data-a-expander-name=\\\"review_text_read_more\\\" data-a-expander-collapsed-height=\\\"300\\\" class=\\\"a-expander-collapsed-height a-row a-expander-container a-expander-partial-collapse-container review-text-read-more-expander\\\" style=\\\"max-height:300px\\\"><div data-hook=\\\"review-collapsed\\\" data-expanded=\\\"false\\\" class=\\\"a-expander-content reviewText review-text-content a-expander-partial-collapse-content\\\">             <span>When my old desktop charger stopped working, I spent a fair bit of time looking for a replacement. I came across the Anker Prime USB C Charger, 200W 6-Port GaN Charging Station, and while the price initially made me hesitate, I quickly realised it was worth every cent.<br/><br/>Despite packing 200W of power, it&#x2019;s incredibly compact, taking up very little space on my desk. Not only does it perform brilliantly, but it also has a premium look and feel, which I really appreciate.<br/><br/>With six ports, there&#x2019;s more than enough capacity to charge multiple devices at once, and I love that it doesn&#x2019;t heat up, so I never have to worry about overheating issues. Plus, it supports Super Fast Charging 2.0 for my Samsung Galaxy S24 Ultra, which is a huge bonus.<br/><br/>On top of its excellent build quality and performance, the 2-year warranty is a nice extra touch. If someone is looking for a high-quality desktop charger that ticks all the boxes, I wouldn&#x2019;t hesitate to recommend this one.<br/></span>   </div><div class=\\\"a-expander-header a-expander-partial-collapse-header\\\"><div class=\\\"a-expander-content-fade\\\"/><a href=\\\"javascript:void(0)\\\" data-hook=\\\"expand-collapse-read-more-less\\\" aria-label=\\\"Read more of this review\\\" aria-expanded=\\\"false\\\" role=\\\"button\\\" data-action=\\\"a-expander-toggle\\\" class=\\\"a-declarative\\\" data-a-expander-toggle=\\\"{&quot;allowLinkDefault&quot;:true, &quot;expand_prompt&quot;:&quot;Read more&quot;, &quot;collapse_prompt&quot;:&quot;Read less&quot;}\\\"><i class=\\\"a-icon a-icon-extender-expand\\\"/><span class=\\\"a-expander-prompt\\\">Read more</span></a></div></div>\",\"rating\":5,\"date\":{\"raw\":\"Reviewed in Australia on March 21, 2025\",\"utc\":\"2025-03-21T00:00:00.000Z\"},\"profile\":{\"name\":\"PAUL S.\"},\"vine_program\":false,\"verified_purchase\":true,\"review_country\":\"au\",\"is_global_review\":true},{\"id\":\"R1N6SARY9U5PHA\",\"title\":\"Great\",\"body\":\"Brilliant, charges laptops really quickly and is great if you want a neat desktop. Read more\",\"body_html\":\"<div data-a-expander-name=\\\"review_text_read_more\\\" data-a-expander-collapsed-height=\\\"300\\\" class=\\\"a-expander-collapsed-height a-row a-expander-container a-expander-partial-collapse-container review-text-read-more-expander\\\" style=\\\"max-height:300px\\\"><div data-hook=\\\"review-collapsed\\\" data-expanded=\\\"false\\\" class=\\\"a-expander-content reviewText review-text-content a-expander-partial-collapse-content\\\">             <span>Brilliant, charges laptops really quickly and is great if you want a neat desktop.<br/></span>   </div><div class=\\\"a-expander-header a-expander-partial-collapse-header\\\"><div class=\\\"a-expander-content-fade\\\"/><a href=\\\"javascript:void(0)\\\" data-hook=\\\"expand-collapse-read-more-less\\\" aria-label=\\\"Read more of this review\\\" aria-expanded=\\\"false\\\" role=\\\"button\\\" data-action=\\\"a-expander-toggle\\\" class=\\\"a-declarative\\\" data-a-expander-toggle=\\\"{&quot;allowLinkDefault&quot;:true, &quot;expand_prompt&quot;:&quot;Read more&quot;, &quot;collapse_prompt&quot;:&quot;Read less&quot;}\\\"><i class=\\\"a-icon a-icon-extender-expand\\\"/><span class=\\\"a-expander-prompt\\\">Read more</span></a></div></div>\",\"rating\":5,\"date\":{\"raw\":\"Reviewed in the United Arab Emirates on May 23, 2025\",\"utc\":\"2025-05-23T00:00:00.000Z\"},\"profile\":{\"name\":\"sameervi\"},\"vine_program\":false,\"verified_purchase\":true,\"review_country\":\"us\",\"is_global_review\":true},{\"id\":\"RGNCZNWSKZ3TH\",\"title\":\"Anker Prime 200W = a yes yes for me\",\"body\":\"Solid, sturdy, and heavy, with high quality construction. It'll stay put like a rock. I am now able to power my laptop, tablet, and phone at the same time and with maximum output for each device. The AC is a good length for me to position the charger where needed. I haven't noticed it heating up yet and so far it's been cool to the touch.  Another great Anker product. I am a fan. Read more\",\"body_html\":\"<div data-a-expander-name=\\\"review_text_read_more\\\" data-a-expander-collapsed-height=\\\"300\\\" class=\\\"a-expander-collapsed-height a-row a-expander-container a-expander-partial-collapse-container review-text-read-more-expander\\\" style=\\\"max-height:300px\\\"><div data-hook=\\\"review-collapsed\\\" data-expanded=\\\"false\\\" class=\\\"a-expander-content reviewText review-text-content a-expander-partial-collapse-content\\\">             <span>Solid, sturdy, and heavy, with high quality construction. It&apos;ll stay put like a rock. I am now able to power my laptop, tablet, and phone at the same time and with maximum output for each device. The AC is a good length for me to position the charger where needed. I haven&apos;t noticed it heating up yet and so far it&apos;s been cool to the touch.<br/><br/>Another great Anker product. I am a fan.<br/></span>   </div><div class=\\\"a-expander-header a-expander-partial-collapse-header\\\"><div class=\\\"a-expander-content-fade\\\"/><a href=\\\"javascript:void(0)\\\" data-hook=\\\"expand-collapse-read-more-less\\\" aria-label=\\\"Read more of this review\\\" aria-expanded=\\\"false\\\" role=\\\"button\\\" data-action=\\\"a-expander-toggle\\\" class=\\\"a-declarative\\\" data-a-expander-toggle=\\\"{&quot;allowLinkDefault&quot;:true, &quot;expand_prompt&quot;:&quot;Read more&quot;, &quot;collapse_prompt&quot;:&quot;Read less&quot;}\\\"><i class=\\\"a-icon a-icon-extender-expand\\\"/><span class=\\\"a-expander-prompt\\\">Read more</span></a></div></div>\",\"rating\":5,\"date\":{\"raw\":\"Reviewed in Canada on June 6, 2025\",\"utc\":\"2025-06-06T00:00:00.000Z\"},\"profile\":{\"name\":\"The guy with funny buttons on his asperx.\"},\"vine_program\":false,\"verified_purchase\":true,\"review_country\":\"ca\",\"is_global_review\":true},{\"id\":\"R1R36OHDI97HKM\",\"title\":\"Tiny but mitey\",\"body\":\"It does exactly what it says it will. It's a fast multiport charger that never warms up. Read more\",\"body_html\":\"<div data-a-expander-name=\\\"review_text_read_more\\\" data-a-expander-collapsed-height=\\\"300\\\" class=\\\"a-expander-collapsed-height a-row a-expander-container a-expander-partial-collapse-container review-text-read-more-expander\\\" style=\\\"max-height:300px\\\"><div data-hook=\\\"review-collapsed\\\" data-expanded=\\\"false\\\" class=\\\"a-expander-content reviewText review-text-content a-expander-partial-collapse-content\\\">             <span>It does exactly what it says it will. It&apos;s a fast multiport charger that never warms up.<br/></span>   </div><div class=\\\"a-expander-header a-expander-partial-collapse-header\\\"><div class=\\\"a-expander-content-fade\\\"/><a href=\\\"javascript:void(0)\\\" data-hook=\\\"expand-collapse-read-more-less\\\" aria-label=\\\"Read more of this review\\\" aria-expanded=\\\"false\\\" role=\\\"button\\\" data-action=\\\"a-expander-toggle\\\" class=\\\"a-declarative\\\" data-a-expander-toggle=\\\"{&quot;allowLinkDefault&quot;:true, &quot;expand_prompt&quot;:&quot;Read more&quot;, &quot;collapse_prompt&quot;:&quot;Read less&quot;}\\\"><i class=\\\"a-icon a-icon-extender-expand\\\"/><span class=\\\"a-expander-prompt\\\">Read more</span></a></div></div>\",\"rating\":5,\"date\":{\"raw\":\"Reviewed in Canada on June 25, 2025\",\"utc\":\"2025-06-25T00:00:00.000Z\"},\"profile\":{\"name\":\"Amazon Customer\"},\"vine_program\":false,\"verified_purchase\":true,\"review_country\":\"ca\",\"is_global_review\":true}]"
}