{
  "title": "UNBREAKcable Bluetooth 5.3 FM Transmitter for Car, [PD 20W + QC 3.0] [Stronger Microphone & HiFi Bass Sound] Cigarette Lighter Radio Music Adapter Charger, Supports Hands-Free Siri Google Assistant",
  "description": "【PD 20W & QC 3.0 Fast Charging, 4X Faster】Wireless bluetooth car adapters can fast charge two devices simultaneously via PD20W and QC3.0 port, 4X faster than standard chargers. This car charger also features a USB charging port (5V/1A) as a USB flash drive port to play music. FM transmitter with built-in overcurrent protection, overvoltage protection, overcharge protection, overload protection, overheat protection and short circuit protection, ensure safe charging of the radio adapter charger.",
  "image": "https://m.media-amazon.com/images/I/718c8JoFZKL.jpg",
  "affiliate_link": "https://www.amazon.com/dp/B08JLNDHJV?tag=imabot01-20",
  "top_reviews": [
    {
      "id": "R18UAISFJIN5UL",
      "title": "Highly recommend",
      "body": "I ordered 2 of these BT transmitters for 2 vehicles. I've been using them for approximately 3 weeks. I am very satisfied so far. In my area, I found station 107.7 be the best frequency to sink to. No static or distortion.  There is a slight gain drop in volume using this. You will find that the radio volume will need to be turned up higher than usual. The transmitter does have volume control built in by way if a multifunction joystick. Up and down of the joystick increases or decreases volume but honestly, I just leave it at max 30, and use the radio to control volume. You may also use your phones volume control as well. All 3 will control volume.  When the tranmitter powers up and after it's paired, it will turn the volume up on your phone to max automatically. I just leave my phone alone after that and use the radio to control volume.  There is a USB- A music input port also that you can plug directly into your phones USB port. This will help increase volume gain if this method is used. The joystick will joystick function to skip , go back, pause and play a song if streaming from a music service like sound cloud. This USB music port will show that your phone is charging but I found it to be a very small charging amperage and will not charge your phone if using it .  There is also a 3A dedicated charging port for fast charging a mobile device. This port works very well but again, it's only for charging.  There is a power button on the side that will turn the transmitter on and off. It is a soft touch button and implies that the unit will still draw some current even if its turned off. I decided to rewire my power port to a switched power supply so that when I turn the vehicle off, the power port loses power and removes the possibility of the device draining my battery if I forget to turn it off.  The pairing was a very simple process. As soon as you plug it in and it's powered up, simply goto BT pairing on your phone and select the proper device and click pair. You're done.  The blue neon ring around the unit is pretty cool. It just so happens to match the led dash lights on my truck. It pulses to the music and is not a distraction. It can be turned off with the touch of a button on the side of the unit.  The joystick is a nice feature. As previously mentioned, it controls volume, play, pause, skip, and back. Very simple to find without looking at the unit and taking your eyes off the road.  Overall, both units I bought have been performing flawlessly. I am quite pleased with the function of them. I recommend this product if you want a simple solution to streaming music in an older vehicle. Read more",
      "stars": 5
    }
  ]
}