{
  "title": "JBL Endurance Race 2 - Waterproof (IP68) Sports True Wireless Earbuds with 4 mics for Crisp, Clear Calls, Pure Bass Sound, 48Hrs of Playback, Plus Speed Charging & Active Noise Cancelling (Blue)",
  "description": "JBL Pure Bass sound: JBL Endurance Race 2 earbuds feature 6.8mm dynamic drivers that deliver powerful JBL Pure Bass sound.",
  "image": "https://m.media-amazon.com/images/I/71XyzqfJf7L.jpg",
  "affiliate_link": "https://www.amazon.com/dp/B0DVTGBCBL?tag=imabot01-20",
  "top_reviews": [
    {
      "id": "R7M0KLIF3Y3FP",
      "title": "Excellent noise cancelling, great sound quality, fit and lots of customization",
      "body": "I pre-ordered these to replace my aging JLB earbuds and I have been so pleased with them. The noise cancelling is like nothing I've ever experienced. I walk in the gym, it's loud in there (big chain gym). Once I turn on the noise cancellation (I use the functional training setting) WHOOSH, all of a sudden, all I can hear is my music. It's incredible. And these things can hold a charge like nothing else. They are very sweat proof. The sound quality is amazing, my music sounds so much better on these than my old earbuds. Getting a fit was easy and they stay in place all workout long, whether I'm lifting, on the elliptical or even doing aerobics. I love the customizable controls for taps. Everything about these is customizable! And they are also ready out of the box. Truly a great investment. With the noise cancelling I can keep the volume lower and it makes my ears feel much better. I do recommend if it's your first time with active noise cancelling (ANC), read up on what it does first. There's a good NYT article on it. All I can hear in the gym with ANC on full is clanking from weights, which is high frequency sound. The low frequency roar of treadmills and the vacuum them are always running is gone once I turn ANC on. Highly recommend, absolutely love them and a great value for the money. Read more",
      "stars": 5
    }
  ]
}