{
  "title": "SanDisk 1TB Extreme Portable SSD - Up to 1050MB/s, USB-C, USB 3.2 Gen 2, IP65 Water and Dust Resistance, Updated Firmware - External Solid State Drive - SDSSDE61-1T00-G25 Black 1TB",
  "description": "Get NVMe solid state performance with up to 1050MB/s read and 1000MB/s write speeds in a portable, high-capacity drive(1) (Based on internal testing; performance may be lower depending on host device & other factors. 1MB=1,000,000 bytes.)",
  "image": "https://m.media-amazon.com/images/I/61zuR3UMnWL.jpg",
  "affiliate_link": "https://www.amazon.com/dp/B08GTYFC37?tag=imabot01-20",
  "top_reviews": [
    {
      "id": "R11BN4OMUHSGN0",
      "title": "Fast, Reliable, and Secure. Perfect for Video Workflows",
      "body": "This SSD has been a great addition to my professional video setup. The speed is exactly what I need, especially when working with high-bitrate footage. With transfer rates up to 1050MB/s, I can move entire projects in minutes. For anyone doing serious video or photo work, this drive gets the job done.  One standout feature is the built-in Disk Lock and Unlock function, which adds a layer of security to your files. It remembers trusted devices, so you do not need to enter your code every time. Just a heads up—if you enter the wrong code a few times, it will wipe the drive, so make sure you do not forget your password. That feature is powerful, but you need to use it carefully.  Build quality is solid, and the drive is light enough to carry around without worry. The only minor drawback is that the included USB-C cable is short. Depending on your setup, the drive might dangle a bit, but it is light enough that it has not caused any issues for me.  Pros:  - Super fast transfer speeds  - 2TB of space for large project files  - Built-in data protection with lock feature  - Recognizes trusted devices  - Rugged and lightweight design  Cons:  - USB-C cable is short  If you are working with large files or need reliable short-term storage for active projects, this is a great option. I use it daily in my video workflow and would absolutely recommend it to any content creator or editor. Read more",
      "stars": 5
    }
  ]
}