{
  "title": "Seagate Portable 4TB External Hard Drive HDD – USB 3.0 for PC, Mac, Xbox, & PlayStation - 1-Year Rescue Service (STGX4000400) Portable HDD 4TB PORTABLE",
  "description": "Easily store and access 4TB of content on the go with the Seagate Portable Drive, a USB external hard drive.Specific uses: Personal",
  "image": "https://m.media-amazon.com/images/I/71UyKKRXQxL.jpg",
  "affiliate_link": "https://www.amazon.com/dp/B07CRGSR16?tag=imabot01-20",
  "top_reviews": [
    {
      "id": "R2373PBTTAQ9GZ",
      "title": "Best Bang-for-the-buck alternative to an expensive NAS",
      "body": "As a retired photographer, with decades of photo/video files (including tons of priceless digitally converted home movies of our daughter growing up & family events), my 10-yr old WDMyCloud had become obsolete and was dying. The cost of new NAS was simply not within my retirement budget, and paying for a cloud backup the last two years was money down the drain (This drive cost less than two years of cloud backup, is exponentially faster and a lot more convenient to access files rapidly). Other methods have their pros & cons, but cost being a personal priority, and after lots of research, I found this little jewel to be the best bang for the buck alternative. It connects to my main desktop computer via the included USB 3.0 cable, and is easy to access by all the computers/devices on my home network. I use a freeware program called FreeFileSync to back up all my important files (photos, videos, documents) daily. FreeFileSync's \"mirror\" option duplicates selected folders from my PC to the expansion drive and updates any changes on a daily schedule. I got the 24TB model, perfect for backing up my main desktop computer (which also has 24 TB of storage). It's a compromise from an expensive NAS but less than 1/4 the price for this much storage. File transfer speeds are typically around 200 mb/sec. and the daily backup update is done seamlessly in the middle of the night. As for longevity, only time will tell, but I've had many Seagate drives over the years, never a failure, and am quite happy with this purchase! Read more",
      "stars": 5
    }
  ]
}