{
  "title": "Fitbit Charge 6 Fitness Tracker with Google apps, Heart Rate on Exercise Equipment, 6-Months Premium Membership Included, GPS, Health Tools and More, Obsidian/Black, One Size (S & L Bands Included) Black Case w/ Black Band Tracker",
  "description": "Turn little habits into healthier routines with Fitbit Charge 6 and Google Pixel Buds Pro 2; get advanced health and fitness insights from Fitbit and power through your workouts with the most comfortable, secure earbuds",
  "image": "https://m.media-amazon.com/images/I/61ZtqtvoD2L.jpg",
  "affiliate_link": "https://www.amazon.com/dp/B0CC62ZG1M?tag=imabot01-20",
  "top_reviews": [
    {
      "id": "R2R2TV3D8X3XRP",
      "title": "Perfect!!",
      "body": "I had a Fitbit for the last few years that I acquired for free, from my insurance company and I absolutely loved it. It finally died. Completely. And I was heartbroken. I didn’t want anything like an Apple Watch because they’re too big and bulky and I don’t need all the extras that are on it. I’m 63 years old. My old Fitbit saved my life because I went into a fib and had no idea what was going on until I checked on my Fitbit to see that I was in trouble. I was at the hospital already with my daughter, sitting with her and immediately a team came in and took me straight downstairs to the ER. I stayed there for a week until I got better. That’s due to this Fitbit that I had. I ordered this Fitbit six, and I love it just the same. Does everything the older one that I had did that was not a six. I have not scratched it at all, and I’m rough on things because I work outside a lot with my hands. I love the heart rate monitoring and the sleep tracking. It’s very comfortable. The size is perfect. If this one ever dies, and I hope it’s a few years before that happens, I will order another one. I’m very happy with these. My only complaint is that the bands from my Fitbit five do not fit this six model. They will not stay attached so I’m scared to order extra bands to go with this six. Read more",
      "stars": 5
    }
  ]
}