{
  "title": "Retractable Car Charger,5 in 1 Fast Car Phone Charger 90W,Bluetooth 5.3 FM Transmitter Adapter,Handsfree Call,2 Retractable Cables and USB Cars Chargers for iPhone 15/14/13 (Black)",
  "description": "PD Retractable Cables - To enhance your driving experience, our fm transmitter includes a 30 W USB C and a 12 W USB iPhone retractable cable, eliminating the need for extra cords and effortlessly charging for both Apple and Android devices. The retractable cables of car charger extend up to 80cm and retract smoothly for a tidy car interior",
  "image": "https://m.media-amazon.com/images/I/71wjvfIUC+L.jpg",
  "affiliate_link": "https://www.amazon.com/dp/B0D3TGGT93?tag=imabot01-20",
  "top_reviews": [
    {
      "id": "RFI2FY7HTC5B1",
      "title": "Versatile and Convenient Car Charger with Bonus Features",
      "body": "The Retractable 5-in-1 Car Charger has been a very practical addition to my car. It combines fast charging, Bluetooth connectivity, and hands-free calling into one compact device.  Pros: Fast Charging with Retractable Cables: The built-in retractable cables keep things organized and clutter-free. They charge my iPhone 15 quickly and reliably. I also appreciate the additional USB ports for other passengers’ devices.  Bluetooth 5.3 FM Transmitter: The Bluetooth connection is stable, and the FM transmitter pairs easily with my car stereo. Streaming music and making hands-free calls has been clear and consistent.  Hands-Free Calling: Calls come through clearly on both ends. The built-in mic works well, and the one-touch call answer button is convenient and safe for driving.  Solid Build: The charger feels sturdy and fits securely in the power outlet. The retractable mechanism feels smooth and durable.  Multi-Device Support: With multiple ports and built-in cables, it's easy to charge several devices at once without sacrificing speed.  Minor Considerations:  FM Frequency Adjustment: Like most FM transmitters, finding the clearest frequency can take a minute in areas with a lot of local stations, but once set, it works reliably.  Size: The charger is a bit larger than a basic car charger, but that's expected given its multiple features.  Final Thoughts: This retractable car charger and FM transmitter is a great all-in-one solution for keeping devices charged, streaming music, and making safe hands-free calls. Highly recommended for drivers who want to stay connected and powered up on the road. Read more",
      "stars": 5
    }
  ]
}