{
  "title": "30W Charging Station for Apple Products, Foldable Wireless Charger with Clock Display&7 Color Ambient Light, for iPad/Tablet Charging Station for iPhone16/15, for Apple Watch10/9 for AirPods4/3(Black",
  "description": "[6-in-1 Wireless Charging Station] This wireless charging station is designed to work seamlessly with Apple products, featuring a wireless charger, a digital clock, and 7 adjustable lights. It allows you to charge for iPhone, for Apple Watch, and for AirPods simultaneously. The wireless charger supports multiple devices and doubles as a stand for iPad, helping you maintain a clean and organized workspace without tangled cables.",
  "image": "https://m.media-amazon.com/images/I/71w68LfcCkL.jpg",
  "affiliate_link": "https://www.amazon.com/dp/B0DNS6LHWM?tag=imabot01-20",
  "top_reviews": [
    {
      "id": "R23FIAN17C7MF7",
      "title": "Everything you for Apple devices",
      "body": "Wish this worked for Android but it doesn't, so i gave it as a gift to my wife. My wife's charging chaos is officially solved!. This 30W station wil sit permanently on the nightstand. It’s super slim but somehow packs in charging for *everything* – iPhone, Apple Watch, AirPods, even a iPad. No more hunting for plugs or tangled wires messing up the place. Or leaving units on the floor to be stepped on.  Seriously impressed with the little touches. The fold-up design is genius for traveling, and the built-in clock? Lifesaver. It’s actually readable at night without being blinding. Plus, the subtle color-changing glow is kinda cool – nice soft light for evenings or just adding a bit of fun.  Everything charges crazy fast, no hiccups. The whole unit feels solid, not cheap at all. Works perfectly. If you’re drowning in cables or just want a cleaner look, this thing is a total win. Oh, and everyone who sees it asks where I got it. So get it if you are in the market. It even comes with the charging box., which nobody does anymore. Read more",
      "stars": 5
    }
  ]
}