{
  "title": "Wireless Charger Station for Samsung, Fast Charging Station with LED Light for SamsunglAndroid Phone. Wireless Phone Charger Station Only for Samsung Watch Brown with Clock",
  "description": "⚡[5-in-1 Multi-Function Charging Station] This versatile wireless station samsnug combines a 3 IN 1 wireless Charger, Digital Alarm Clock, and Adjustable Bedside Lamp, catering to an array of devices like Samsung Galaxy, Watches and Headphones. 15W Fast Charging for Samsung Galaxy phone which support wireless charging and offers 5W Wireless Charging for Watches. Also, it supports 5W wireless charging for Samsnug Galaxy Buds. Note: Watch charging is exclusive to Samsnug Galaxy Watch",
  "image": "https://m.media-amazon.com/images/I/71FQz+KCUML.jpg",
  "affiliate_link": "https://www.amazon.com/dp/B0CB17VR8Q?tag=imabot01-20",
  "top_reviews": [
    {
      "id": "R304Y81L7SK6K0",
      "title": "Great Station With Great Features",
      "body": "We have Samsung Galaxy Note phones and these stations work great. Love the various charging features including the phone easily placed on top, the watch that sets on its own stand and the ear buds charging in a space of their own. The different lighting choices work and look great too. Our phones can be charged while still in their cases which is a huge plus since my wife has a thick case with credit cards in it. I like the room dark when sleeping so I like that the clock has a sleep feature where the display is turned off and only a small \"Zz\" is displayed. To some that may still be too much (of course can always cover that small Z with a piece of electric tape) but it's not as obtrusive as most. The one thing missing is a manual snooze button. It has an automatic snooze where the alarm goes for 30 seconds at a time (28 seconds, pauses for 2 seconds) and repeats this cycle for 3 minutes (6 times) before sleeping for 9 minutes and doing it all over again. There's no way to slap a snooze and have it wait 9 minutes before the alarm goes off again. Once you turn off the alarm (by hitting any button on the back), that's it. So we have to use Alexa for the alarm feature and these for the charging and light features. It doesn't take away as it's well worth the purchase for the various features included, just for us it would save having to use another device for the alarm/snooze. Read more",
      "stars": 5
    }
  ]
}