{
  "title": "Itx Mini Case - K39 (Steel),1U Power Supply,Front I/O USB & Type-C Port,2 Handle can be Installed,Vented Panel - 2 Steel & 1 Acrylic Side Panels / 5L SFF Case",
  "description": "【TIPS】 This item does not include GPU riser cable, you need to purchase an additional 19.5cm Dual Reverse Connectors riser cable. It is not recommended for novices to install for the first time, please learn through online video before purchasing.",
  "image": "https://m.media-amazon.com/images/I/61zjNHZjDWL.jpg",
  "affiliate_link": "https://www.amazon.com/dp/B09BJZGKDD?tag=imabot01-20",
  "top_reviews": [
    {
      "id": "R9TOY4BDQ02TM",
      "title": "A lovely case, mini ITX  is king again!",
      "body": "I've always liked the mini ITX factor, however hard the motherboards are to find. So, I decided to move my i5 9400 + Asus Motherboard (h310i) from a bigger Riotoro case over to this beautiful 5L thing. You have to really see it in person to understand how small this is (Perfect size, I'd say, in part thanks to the Flex PSU of course). And sturdy steel, I love that!  But it was a breeze to install (no graphics board, though, which may pose some extra effort, and a riser cable, sold separately now). I didn't take off the back piece to mount the motherboard, just screwed in situ (YMMV). True, the USB cable is a bit long, the USB-C is interesting but not using it now. The power button is well positioned. The acrylic optional side panel is cool but I kept the steel one.  You'll need to make holes in the plastic protector grill, to install the SSD on the side panel. Usually I guess you'll go nvme but this is an older build. I forgot to affix the handle (you need to do it at first), the strap is crazy. A box with goodies like screws and screwdriver is really a nice extra. My build runs cool with the Intel stock cooler.  The price is excellent; the Flex PSU is where the real cost is. It really brought this old but powerful build back to life! Read more",
      "stars": 5
    }
  ]
}